In [1118]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import numpy as np
import re
import datetime

In [1119]:
df = pd.read_csv("attacks.csv", engine="python")
df.head(3)

,Case Number,Date,Year,Type,Country,Area,Location,Activity,Name,Sex,...,Species,Investigator or Source,pdf,href formula,href,Case Number.1,Case Number.2,original order,Unnamed: 22,Unnamed: 23
0,2018.06.25,25-Jun-2018,2018.0,Boating,USA,California,"Oceanside, San Diego County",Paddling,Julie Wolfe,F,...,White shark,"R. Collier, GSAF",2018.06.25-Wolfe.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2018.06.25,2018.06.25,6303.0,NaN,NaN
1,2018.06.18,18-Jun-2018,2018.0,Unprovoked,USA,Georgia,"St. Simon Island, Glynn County",Standing,Adyson�McNeely,F,...,NaN,"K.McMurray, TrackingSharks.com",2018.06.18-McNeely.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2018.06.18,2018.06.18,6302.0,NaN,NaN
2,2018.06.09,09-Jun-2018,2018.0,Invalid,USA,Hawaii,"Habush, Oahu",Surfing,John Denges,M,...,NaN,"K.McMurray, TrackingSharks.com",2018.06.09-Denges.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2018.06.09,2018.06.09,6301.0,NaN,NaN

In [1120]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25723 entries, 0 to 25722
Data columns (total 24 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Case Number             8702 non-null   object
 1   Date                    6302 non-null   object
 2   Year                    6300 non-null   float64
 3   Type                    6298 non-null   object
 4   Country                 6252 non-null   object
 5   Area                    5847 non-null   object
 6   Location                5762 non-null   object
 7   Activity                5758 non-null   object
 8   Name                    6092 non-null   object
 9   Sex                     5737 non-null   object
 10  Age                     3471 non-null   object
 11  Injury                  6274 non-null   object
 12  Fatal (Y/N)             5763 non-null   object
 13  Time                    2948 non-null   object
 14  Species                 3464 non-null   object
 15  Investigator or Source  6285 non-null   object
 16  pdf                     6302 non-null   object
 17  href formula            6301 non-null   object
 18  href                    6302 non-null   object
 19  Case Number.1           6302 non-null   object
 20  Case Number.2           6302 non-null   object
 21  original order          6309 non-null   float64
 22  Unnamed: 22             1 non-null      object
 23  Unnamed: 23             2 non-null      object
dtypes: float64(2), object(22)
memory usage: 4.7+ MB

I check column by column with 'df["column"]' and 'df["column"].value_counts()' so that I can observe if the info is useful and if there are repeated categories or mixed formats. Results:

- All the columns have NaN values.
- Case Number: Probably unusefull. 
- Date: Mixed format.
- Year: Mixed format and wrong data.                  
- Type: Repeated categories with different names.                   
- Activity: Repeated categories with different names. 
- Name: Mixed data with sex. Not relevant.  I will ignore this column.  
- Sex: the index has a space on the right. A few repeated category because of the format. Missing values. I will ignore this column.
- Age: mixed format. Wrong data. Missing data. I will ignore this column. I will ignore this column.
- Fatal (Y/N): mixed format. Wrong data. 
- Time: mixed format. Missing information
- Species: the index has a space on the right. Repeated categories with different names.
- Investigator or Source: probably unusefull. 
- pdf:  probably unusefull. 
- href formula: Only usefull to get missing data.
- href: Only usefull to get missing data.
- Case Number.1: Probably unusefull.
- Case Number.2: Probably unusefull.
- original order: Probably unusefull.
- Unnamed: 22: Probably unusefull.
- Unnamed: 23: Probably unusefull.

In [1121]:
df_clean = df.copy() # I make a copy, the clean one.

# I create list comprehension of the columns I don't need to drop it:
column_names = df_clean.columns
columns_unuseful = [column_names[i] for i in [0,8,9,10,13,15,16,17,18,19,20,21,22,23]]

df_clean.drop(columns_unuseful, inplace=True, axis=1)

In [1122]:
#Now I make the column names upper case.
df_clean.columns = df_clean.columns.str.upper()

In [1123]:
df_clean.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25723 entries, 0 to 25722
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   DATE         6302 non-null   object
 1   YEAR         6300 non-null   float64
 2   TYPE         6298 non-null   object
 3   COUNTRY      6252 non-null   object
 4   AREA         5847 non-null   object
 5   LOCATION     5762 non-null   object
 6   ACTIVITY     5758 non-null   object
 7   INJURY       6274 non-null   object
 8   FATAL (Y/N)  5763 non-null   object
 9   SPECIES      3464 non-null   object
dtypes: float64(1), object(9)
memory usage: 2.0+ MB

In [1124]:
# I get the sume of the NaN in my dataframe:
df_clean.isna().sum()

DATE           19421
YEAR           19423
TYPE           19425
COUNTRY        19471
AREA           19876
LOCATION       19961
ACTIVITY       19965
INJURY         19449
FATAL (Y/N)    19960
SPECIES        22259
dtype: int64

In [1125]:
#Then I drop NaN values keeping only the rows with at least 2 non-NA values:
df_clean = df_clean.dropna(thresh=2)
df_clean.isna().sum()

DATE              0
YEAR              2
TYPE              4
COUNTRY          50
AREA            455
LOCATION        540
ACTIVITY        544
INJURY           28
FATAL (Y/N)     539
SPECIES        2838
dtype: int64

## YEAR

In [1126]:
df_clean["YEAR"]

0       2018.0
1       2018.0
2       2018.0
3       2018.0
4       2018.0
         ...
6297       0.0
6298       0.0
6299       0.0
6300       0.0
6301       0.0
Name: YEAR, Length: 6302, dtype: float64

In [1127]:
df_clean[df_clean["YEAR"] == 0.0].head(3)
# We can leave out these 125 cases as they are not really significant, they are too old with a lot of missing date.

,DATE,YEAR,TYPE,COUNTRY,AREA,LOCATION,ACTIVITY,INJURY,FATAL (Y/N),SPECIES
6177,Ca. 214 B.C.,0.0,Unprovoked,NaN,Ionian Sea,NaN,Ascending from a dive,"FATAL, shark/s bit him in two",Y,NaN
6178,Ca. 336.B.C..,0.0,Unprovoked,GREECE,Piraeus,In the haven of Cantharus,Washing his pig in preparation for a religious...,"FATAL, shark ""bit off all lower parts of him u...",Y,NaN
6179,493 B.C.,0.0,Sea Disaster,GREECE,Off Thessaly,NaN,Shipwrecked Persian Fleet,Herodotus tells of sharks attacking men in the...,Y,NaN

In [1128]:
#After this evaluation I will keep only the relevant data which would be from 1950:
df_clean = df_clean[df_clean["YEAR"] >= 1950]
df_clean.head(3)

,DATE,YEAR,TYPE,COUNTRY,AREA,LOCATION,ACTIVITY,INJURY,FATAL (Y/N),SPECIES
0,25-Jun-2018,2018.0,Boating,USA,California,"Oceanside, San Diego County",Paddling,"No injury to occupant, outrigger canoe and pad...",N,White shark
1,18-Jun-2018,2018.0,Unprovoked,USA,Georgia,"St. Simon Island, Glynn County",Standing,Minor injury to left thigh,N,NaN
2,09-Jun-2018,2018.0,Invalid,USA,Hawaii,"Habush, Oahu",Surfing,Injury to left lower leg from surfboard skeg,N,NaN


## DATE

In [1129]:
df_clean["DATE"].value_counts()

1957                            11
1956                             8
1950                             7
1958                             7
28-Jul-1995                      5
                                ..
30-Mar-1971                      1
Mid Jul-1985 or mid Jul-1986     1
12-Aug-2014                      1
Reported      10-Dec-1994        1
20-Mar-1967                      1
Name: DATE, Length: 3817, dtype: int64

In [1130]:
#print(set(df_clean["DATE"]))

In [1131]:
df_clean["DATE"]=df_clean["DATE"].str.strip("Reported")
df_clean["DATE"]=df_clean["DATE"].str.strip(" Reported")
df_clean["DATE"]=df_clean["DATE"].str.strip(".Reported")
df_clean["DATE"]=df_clean["DATE"].str.strip("Late 1600s Reported")
df_clean["DATE"]=df_clean["DATE"].str.strip('Reported to have happened  "on the weekend"')

In [1132]:
#print(set(df_clean["DATE"]))

## MONTH

I create a new columns only with months

In [1133]:
#I try to create a new column with months. But it didn't work...
df_clean["MONTH"] = np.where(df_clean["DATE"].str.contains("Jan"), "Jan", df_clean["DATE"])
def months_column(x,y):
    df_clean["MONTH"] = np.where(df_clean["DATE"].str.contains(x), y, df_clean["MONTH"])
months_column("Jan","Jan")
months_column("Feb", "Feb")
months_column("Mar", "Mar")
months_column("Apr", "Apr")
months_column("May","May")
months_column("Jun","Jun")
months_column("Jul","Jul")
months_column("Aug","Aug")
months_column("Sep","Sep")
months_column("Oct","Oct")
months_column("Nov","Nov")
months_column("Dec","Dec")

df_clean['MONTH']=np.where(df_clean['MONTH'].str.contains("Ap"), "Apr", df_clean['MONTH'])
df_clean['MONTH']=np.where(df_clean['MONTH'].str.contains("Summer"), "Summer", df_clean['MONTH'])
df_clean['MONTH']=np.where(df_clean['MONTH'].str.contains("summer"), "Summer", df_clean['MONTH'])
df_clean['MONTH']=np.where(df_clean['MONTH'].str.contains("Fall"), "Fall", df_clean['MONTH'])
df_clean['MONTH']=np.where(df_clean['MONTH'].str.contains("Winter"), "Winter", df_clean['MONTH'])

In [1134]:
print (df_clean['MONTH'].unique())

['Jun' 'May' 'Apr' 'Mar' 'Feb' 'Jan' 'Dec' 'Nov' 'Oct' 'Sep' 'Aug' 'Jul'
 '2017.06.05' '2014' '2008.01.3' 'Fall' 'Summer' '2004' '2' '999' '998'
 '99' '995' 'incident of 1994 in Hong Kong' '994' '993' '992' '989' '988'
 '987' '98' '985' '984' 'Ca. 1983' '983' '982' '2-30-198' '979' '978' '97'
 '975' '974' '973' '972' 'Ca. 197' 'Winter' '968' '965' 'Early 1965'
 'Ca. 1965' 'Early 1963' '963' '962' 'Ca. 1962' '9' '960-19' 'Ca. 19'
 '21764' '959' '958-1959' '958' 'Circa 1958' '957' '95' '955' 'Ca. 1955'
 '9955' '954' '954 (same day as  1954.00.00.f)' '953' '952-1954' '952'
 '\n1951.12.15' '950.07.19' '950 - 195' 'Ca. 195']

## TYPE

In [1075]:
df_clean["TYPE"]

0          Boating
1       Unprovoked
2          Invalid
3       Unprovoked
4         Provoked
           ...
4493    Unprovoked
4494    Unprovoked
4495    Unprovoked
4496    Unprovoked
4497    Unprovoked
Name: TYPE, Length: 4497, dtype: object

In [1076]:
print (df_clean['TYPE'].unique())

['Boating' 'Unprovoked' 'Invalid' 'Provoked' 'Questionable' 'Sea Disaster'
 nan 'Boat' 'Boatomg']

In [1137]:
df_clean['TYPE']=df_clean['TYPE'].fillna("Unknown")

df_clean['TYPE']=np.where(df_clean['TYPE'].str.startswith('Boa'), 
                            "Boating", 
                            df_clean['TYPE'])

In [1138]:
print (df_clean['TYPE'].unique())

['Boating' 'Unprovoked' 'Invalid' 'Provoked' 'Questionable' 'Sea Disaster'
 'Unknown']

## ACTIVITY

In [1139]:
df_clean["ACTIVITY"]

0                                                Paddling
1                                                Standing
2                                                 Surfing
3                                                 Surfing
4                                             Free diving
                              ...
4493                                             Swimming
4494                                     Diving for coins
4495    Spearfishing, but walking carrying fish on end...
4496              Helmet diving, collecting trochus shell
4497                                                  NaN
Name: ACTIVITY, Length: 4497, dtype: object

In [1140]:
df_clean['ACTIVITY'] = df_clean['ACTIVITY'].str.lower()

In [1141]:
df_clean['ACTIVITY_TYPE']=df_clean['ACTIVITY'].fillna("Unknown")
df_clean['ACTIVITY_TYPE']=np.where(df_clean['ACTIVITY'].str.contains("surf"), "Surfing", df_clean['ACTIVITY'])
df_clean['ACTIVITY_TYPE']=np.where(df_clean['ACTIVITY'].str.contains("div"), "Diving", df_clean['ACTIVITY_TYPE'])
df_clean['ACTIVITY_TYPE']=np.where(df_clean['ACTIVITY'].str.contains("swim"), "Swiming", df_clean['ACTIVITY_TYPE'])
df_clean['ACTIVITY_TYPE']=np.where(df_clean['ACTIVITY'].str.contains("fish"), "Fishing", df_clean['ACTIVITY_TYPE'])

In [1142]:
#print (df_clean['ACTIVITY_TYPE'].unique())

## COUNTRY

In [1143]:
print (df_clean['COUNTRY'].unique())

['USA' 'AUSTRALIA' 'MEXICO' 'BRAZIL' 'ENGLAND' 'SOUTH AFRICA' 'THAILAND'
 'COSTA RICA' 'MALDIVES' 'BAHAMAS' 'NEW CALEDONIA' 'ECUADOR' 'MALAYSIA'
 'LIBYA' nan 'CUBA' 'MAURITIUS' 'NEW ZEALAND' 'SPAIN' 'SAMOA'
 'SOLOMON ISLANDS' 'JAPAN' 'EGYPT' 'ST HELENA, British overseas territory'
 'COMOROS' 'REUNION' 'FRENCH POLYNESIA' 'UNITED KINGDOM'
 'UNITED ARAB EMIRATES' 'PHILIPPINES' 'INDONESIA' 'CHINA' 'COLUMBIA'
 'CAPE VERDE' 'Fiji' 'DOMINICAN REPUBLIC' 'CAYMAN ISLANDS' 'ARUBA'
 'MOZAMBIQUE' 'FIJI' 'PUERTO RICO' 'ITALY' 'ATLANTIC OCEAN' 'GREECE'
 'ST. MARTIN' 'FRANCE' 'PAPUA NEW GUINEA' 'TRINIDAD & TOBAGO' 'KIRIBATI'
 'ISRAEL' 'DIEGO GARCIA' 'TAIWAN' 'JAMAICA' 'PALESTINIAN TERRITORIES'
 'GUAM' 'SEYCHELLES' 'BELIZE' 'NIGERIA' 'TONGA' 'SCOTLAND' 'CANADA'
 'CROATIA' 'SAUDI ARABIA' 'CHILE' 'ANTIGUA' 'KENYA' 'RUSSIA'
 'TURKS & CAICOS' 'UNITED ARAB EMIRATES (UAE)' 'AZORES' 'SOUTH KOREA'
 'MALTA' 'VIETNAM' 'MADAGASCAR' 'PANAMA' 'SOMALIA' 'NEVIS'
 'BRITISH VIRGIN ISLANDS' 'NORWAY' 'SENEGAL' 'YEMEN' 'GULF OF ADEN'
 'Sierra Leone' 'ST. MAARTIN' 'GRAND CAYMAN' 'Seychelles' 'LIBERIA'
 'VANUATU' 'MEXICO ' 'HONDURAS' 'VENEZUELA' 'SRI LANKA' ' TONGA' 'URUGUAY'
 'INDIA' 'MICRONESIA' 'CARIBBEAN SEA' 'OKINAWA' 'TANZANIA'
 'MARSHALL ISLANDS' 'EGYPT / ISRAEL' 'NORTHERN ARABIAN SEA' 'HONG KONG'
 'EL SALVADOR' 'ANGOLA' 'BERMUDA' 'MONTENEGRO' 'IRAN' 'TUNISIA' 'NAMIBIA'
 'NORTH ATLANTIC OCEAN' 'PORTUGAL' 'SOUTH CHINA SEA' 'BANGLADESH' 'PALAU'
 'WESTERN SAMOA' 'PACIFIC OCEAN ' 'BRITISH ISLES' 'GRENADA' 'IRAQ'
 'TURKEY' 'SINGAPORE' 'NEW BRITAIN' 'SUDAN' 'JOHNSTON ISLAND'
 'SOUTH PACIFIC OCEAN' 'NEW GUINEA' 'RED SEA' 'NORTH PACIFIC OCEAN'
 'FEDERATED STATES OF MICRONESIA' 'MID ATLANTIC OCEAN' 'ADMIRALTY ISLANDS'
 'BRITISH WEST INDIES' 'SOUTH ATLANTIC OCEAN' 'PERSIAN GULF'
 'RED SEA / INDIAN OCEAN' 'PACIFIC OCEAN' 'NORTH SEA' 'NICARAGUA '
 'MALDIVE ISLANDS' 'AMERICAN SAMOA' 'ANDAMAN / NICOBAR ISLANDAS' 'GABON'
 'MAYOTTE' 'NORTH ATLANTIC OCEAN ' 'THE BALKANS' 'SUDAN?' 'ARGENTINA'
 'MARTINIQUE' 'INDIAN OCEAN' 'GUATEMALA' 'NETHERLANDS ANTILLES']

In [1146]:
df_clean['COUNTRY'] = df_clean['COUNTRY'].str.upper()

In [1147]:
#Irealize that this methode change the NaN elements, so first of all I have to re-fill them.
df_clean['COUNTRY']=df_clean['COUNTRY'].fillna("UNKNOWN")
df_clean['COUNTRY']=np.where(df_clean['COUNTRY'].str.contains("EMIRATES"), "UNITED ARAB EMIRATES", df_clean['COUNTRY'])
df_clean['COUNTRY']=np.where(df_clean['COUNTRY'].str.contains("ENGLAND"), "UNITED KINGDOM", df_clean['COUNTRY'])
df_clean['COUNTRY']=np.where(df_clean['COUNTRY'].str.contains("ST. MAARTIN"), "ST. MARTIN", df_clean['COUNTRY'])
df_clean['COUNTRY']=np.where(df_clean['COUNTRY'].str.contains("BRITISH ISLES"), "UNITED KINGDOM", df_clean['COUNTRY'])
df_clean['COUNTRY']=np.where(df_clean['COUNTRY'].str.contains("SUDAN?"), "SUDAN", df_clean['COUNTRY'])
df_clean['COUNTRY']=np.where(df_clean['COUNTRY'].str.contains("NEW GUINEA"), "PAPUA NEW GUINEA", df_clean['COUNTRY'])
df_clean['COUNTRY']=np.where(df_clean['COUNTRY'].str.contains("RED SEA"), "RED SEA", df_clean['COUNTRY'])
df_clean['COUNTRY']=np.where(df_clean['COUNTRY'].str.contains("GRAND CAYMAN"), "CAYMAN ISLANDS", df_clean['COUNTRY'])
df_clean['COUNTRY']=np.where(df_clean['COUNTRY'].str.contains("FEDERATED STATES OF MICRONESIA"), "MICRONESIA", df_clean['COUNTRY'])
df_clean['COUNTRY']=np.where(df_clean['COUNTRY'].str.contains("PACIFIC OCEAN "), "PACIFIC OCEAN", df_clean['COUNTRY'])

In [1148]:
print (df_clean['COUNTRY'].unique())

['USA' 'AUSTRALIA' 'MEXICO' 'BRAZIL' 'UNITED KINGDOM' 'SOUTH AFRICA'
 'THAILAND' 'COSTA RICA' 'MALDIVES' 'BAHAMAS' 'NEW CALEDONIA' 'ECUADOR'
 'MALAYSIA' 'LIBYA' 'UNKNOWN' 'CUBA' 'MAURITIUS' 'NEW ZEALAND' 'SPAIN'
 'SAMOA' 'SOLOMON ISLANDS' 'JAPAN' 'EGYPT'
 'ST HELENA, BRITISH OVERSEAS TERRITORY' 'COMOROS' 'REUNION'
 'FRENCH POLYNESIA' 'UNITED ARAB EMIRATES' 'PHILIPPINES' 'INDONESIA'
 'CHINA' 'COLUMBIA' 'CAPE VERDE' 'FIJI' 'DOMINICAN REPUBLIC'
 'CAYMAN ISLANDS' 'ARUBA' 'MOZAMBIQUE' 'PUERTO RICO' 'ITALY'
 'ATLANTIC OCEAN' 'GREECE' 'ST. MARTIN' 'FRANCE' 'PAPUA NEW GUINEA'
 'TRINIDAD & TOBAGO' 'KIRIBATI' 'ISRAEL' 'DIEGO GARCIA' 'TAIWAN' 'JAMAICA'
 'PALESTINIAN TERRITORIES' 'GUAM' 'SEYCHELLES' 'BELIZE' 'NIGERIA' 'TONGA'
 'SCOTLAND' 'CANADA' 'CROATIA' 'SAUDI ARABIA' 'CHILE' 'ANTIGUA' 'KENYA'
 'RUSSIA' 'TURKS & CAICOS' 'AZORES' 'SOUTH KOREA' 'MALTA' 'VIETNAM'
 'MADAGASCAR' 'PANAMA' 'SOMALIA' 'NEVIS' 'BRITISH VIRGIN ISLANDS' 'NORWAY'
 'SENEGAL' 'YEMEN' 'GULF OF ADEN' 'SIERRA LEONE' 'LIBERIA' 'VANUATU'
 'MEXICO ' 'HONDURAS' 'VENEZUELA' 'SRI LANKA' ' TONGA' 'URUGUAY' 'INDIA'
 'MICRONESIA' 'CARIBBEAN SEA' 'OKINAWA' 'TANZANIA' 'MARSHALL ISLANDS'
 'EGYPT / ISRAEL' 'NORTHERN ARABIAN SEA' 'HONG KONG' 'EL SALVADOR'
 'ANGOLA' 'BERMUDA' 'MONTENEGRO' 'IRAN' 'TUNISIA' 'NAMIBIA'
 'NORTH ATLANTIC OCEAN' 'PORTUGAL' 'SOUTH CHINA SEA' 'BANGLADESH' 'PALAU'
 'WESTERN SAMOA' 'PACIFIC OCEAN' 'GRENADA' 'IRAQ' 'TURKEY' 'SINGAPORE'
 'NEW BRITAIN' 'SUDAN' 'JOHNSTON ISLAND' 'SOUTH PACIFIC OCEAN' 'RED SEA'
 'NORTH PACIFIC OCEAN' 'MID ATLANTIC OCEAN' 'ADMIRALTY ISLANDS'
 'BRITISH WEST INDIES' 'SOUTH ATLANTIC OCEAN' 'PERSIAN GULF' 'NORTH SEA'
 'NICARAGUA ' 'MALDIVE ISLANDS' 'AMERICAN SAMOA'
 'ANDAMAN / NICOBAR ISLANDAS' 'GABON' 'MAYOTTE' 'NORTH ATLANTIC OCEAN '
 'THE BALKANS' 'ARGENTINA' 'MARTINIQUE' 'INDIAN OCEAN' 'GUATEMALA'
 'NETHERLANDS ANTILLES']

## AREA

In [1149]:
#print(df_clean['AREA'].unique())
#too messy

## INJURY

In [1150]:
#print(df_clean['INJURY'].unique())
#too messy

## FATAL (Y/N)

In [1151]:
print(df_clean['FATAL (Y/N)'].unique())

['N' 'Y' nan 'M' 'UNKNOWN' '2017' ' N']

In [1152]:
df_clean['FATAL (Y/N)']=df_clean['FATAL (Y/N)'].fillna("UNKNOWN")
df_clean['FATAL (Y/N)']=np.where(df_clean['FATAL (Y/N)'].str.contains("M"), "N", df_clean['FATAL (Y/N)'])
df_clean['FATAL (Y/N)']=np.where(df_clean['FATAL (Y/N)'].str.contains(" N"), "N", df_clean['FATAL (Y/N)'])
df_clean['FATAL (Y/N)']=np.where(df_clean['FATAL (Y/N)'].str.contains("2017"), "N", df_clean['FATAL (Y/N)'])

In [1153]:
print(df_clean['FATAL (Y/N)'].unique())

['N' 'Y' 'UNKNOWN']

In [1154]:
df_clean.isna().sum()

DATE                0
YEAR                0
TYPE                0
COUNTRY             0
AREA              217
LOCATION          272
ACTIVITY          320
INJURY             15
FATAL (Y/N)         0
SPECIES          1602
MONTH               0
ACTIVITY_TYPE       0
dtype: int64

## SPECIES

In [1155]:
print(df_clean['SPECIES '].unique())

['White shark' nan '2 m shark' ...
 "Tiger shark, 3.7 m to 4.3 m  [12' to 14']"
 'Alleged to involve a white shark "with little yellow eyes"'
 "2.7 m [9'] shark with black-tipped pectoral fins"]

In [1156]:
df_clean['SPECIES'] = df_clean['SPECIES '].fillna("UNKNOWN")
df_clean['SPECIES'] = df_clean['SPECIES'].str.lower()

In [1157]:
df_clean['SPECIES']=np.where(df_clean['SPECIES'].str.contains("white"), "white shark", df_clean['SPECIES'])
df_clean['SPECIES']=np.where(df_clean['SPECIES'].str.contains("tiger"), "tiger shark", df_clean['SPECIES'])
df_clean['SPECIES']=np.where(df_clean['SPECIES'].str.contains("bull"), "bull shark", df_clean['SPECIES'])
df_clean['SPECIES']=np.where(df_clean['SPECIES'].str.contains("blacktip"), "blacktip shark", df_clean['SPECIES'])
df_clean['SPECIES']=np.where(df_clean['SPECIES'].str.contains("lemon"), "lemon shark", df_clean['SPECIES'])
df_clean['SPECIES']=np.where(df_clean['SPECIES'].str.contains("grey"), "grey shark", df_clean['SPECIES'])

In [1158]:
print(df_clean['SPECIES '].unique())

['White shark' nan '2 m shark' ...
 "Tiger shark, 3.7 m to 4.3 m  [12' to 14']"
 'Alleged to involve a white shark "with little yellow eyes"'
 "2.7 m [9'] shark with black-tipped pectoral fins"]

In [1160]:
df_clean['SPECIES'] = df_clean['SPECIES'].fillna("Unknown")
df_clean.isna().sum()
#What am I doing wrong?

DATE                0
YEAR                0
TYPE                0
COUNTRY             0
AREA              217
LOCATION          272
ACTIVITY          320
INJURY             15
FATAL (Y/N)         0
SPECIES          1602
MONTH               0
ACTIVITY_TYPE       0
SPECIES             0
dtype: int64

In [1161]:
df_clean.head(5)

,DATE,YEAR,TYPE,COUNTRY,AREA,LOCATION,ACTIVITY,INJURY,FATAL (Y/N),SPECIES,MONTH,ACTIVITY_TYPE,SPECIES
0,25-Jun-2018,2018.0,Boating,USA,California,"Oceanside, San Diego County",paddling,"No injury to occupant, outrigger canoe and pad...",N,White shark,Jun,paddling,white shark
1,8-Jun-2018,2018.0,Unprovoked,USA,Georgia,"St. Simon Island, Glynn County",standing,Minor injury to left thigh,N,NaN,Jun,standing,unknown
2,9-Jun-2018,2018.0,Invalid,USA,Hawaii,"Habush, Oahu",surfing,Injury to left lower leg from surfboard skeg,N,NaN,Jun,Surfing,unknown
3,8-Jun-2018,2018.0,Unprovoked,AUSTRALIA,New South Wales,Arrawarra Headland,surfing,Minor injury to lower leg,N,2 m shark,Jun,Surfing,2 m shark
4,4-Jun-2018,2018.0,Provoked,MEXICO,Colima,La Ticla,free diving,Lacerations to leg & hand shark PROVOKED INCIDENT,N,"Tiger shark, 3m",Jun,Diving,tiger shark

In [1162]:
%store df_clean

Stored 'df_clean' (DataFrame)

In [1163]:
df_clean.to_csv(r'pandas-project\attacks_clean.csv', index = False)